## Terraform Plan Output

###  Infrastructure Changes
<details>
<summary>Click to view Terraform plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudfront.aws_cloudfront_distribution.cdn will be created
  + resource "aws_cloudfront_distribution" "cdn" {
      + aliases                         = [
          + "blog.deployverse.dev",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + logging_v1_enabled              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "deployverse-frontend"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_access_control_id    = (known after apply)
          + origin_id                   = "deployverse-frontend"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:886121091826:certificate/dccd3b30-94c2-4e83-b9b0-7d2b8e9980b7"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.oac will be created
  + resource "aws_cloudfront_origin_access_control" "oac" {
      + arn                               = (known after apply)
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "frontend-oac-for-deployverse-frontend"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.ec2.aws_instance.my_ec2 will be created
  + resource "aws_instance" "my_ec2" {
      + ami                                  = "ami-07860a2d7eb515d9a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "deployverse-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "project" = "deployverse"
        }
      + tags_all                             = {
          + "project" = "deployverse"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            #!/bin/bash
            
            # Update packages
            yum update -y
            
            # Install Docker
            yum install -y docker
            systemctl enable docker
            systemctl start docker
            
            # Add ec2-user to docker group
            usermod -aG docker ec2-user
            
            # Install Nginx
            yum install -y nginx
            systemctl enable nginx
            systemctl start nginx
            
            # Nginx reverse proxy
            cat > /etc/nginx/conf.d/deployverse.conf <<NGINXCONF
            server {
                listen 80;
                server_name api.blog.deployverse.dev;
            
                location / {
                    proxy_pass http://127.0.0.1:5000;
                    proxy_http_version 1.1;
                    proxy_set_header Host \$host;
                    proxy_set_header X-Real-IP \$remote_addr;
                    proxy_set_header X-Forwarded-For \$proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto \$scheme;
                }
            }
            NGINXCONF
            
            nginx -t && systemctl reload nginx
            
            # Install Certbot
            yum install -y certbot python3-certbot-nginx
            
            # Wait for DNS propagation
            sleep 20
            
            # Obtain SSL certificate with redirect
            certbot --nginx -d api.blog.deployverse.dev \
              --non-interactive --agree-tos -m saapkotaamrit1999@gmail.com --redirect
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + primary_network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.ec2.aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Security group for EC2"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ec2_sg_deployverse"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.ec2.aws_vpc_security_group_egress_rule.all_outbound will be created
  + resource "aws_vpc_security_group_egress_rule" "all_outbound" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.ec2.aws_vpc_security_group_ingress_rule.http will be created
  + resource "aws_vpc_security_group_ingress_rule" "http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 80
    }

  # module.ec2.aws_vpc_security_group_ingress_rule.https will be created
  + resource "aws_vpc_security_group_ingress_rule" "https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

  # module.ec2.aws_vpc_security_group_ingress_rule.ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 22
    }

  # module.route53_cf.aws_route53_record.alias[0] will be created
  + resource "aws_route53_record" "alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "blog.deployverse.dev"
      + type            = "A"
      + zone_id         = "Z1012104KZFXCNZ0FIQG"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.route53_ec2.aws_route53_record.standard[0] will be created
  + resource "aws_route53_record" "standard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.blog.deployverse.dev"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z1012104KZFXCNZ0FIQG"
    }

  # module.s3.aws_s3_bucket.frontend_bucket will be created
  + resource "aws_s3_bucket" "frontend_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "deployverse-frontend"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3.aws_s3_bucket_policy.allow_cloudfront_oac will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_oac" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-1"
    }

  # module.s3.aws_s3_bucket_public_access_block.block_public will be created
  + resource "aws_s3_bucket_public_access_block" "block_public" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-1"
      + restrict_public_buckets = true
    }

  # module.s3.aws_s3_bucket_versioning.versioning will be created
  + resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.vpc.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_assoc will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.main will be created
  + resource "aws_subnet" "main" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags_all                             = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ec2_instance_id = (known after apply)
  + s3_bucket_name  = (known after apply)

```

</details>

---

###  Security Scan Results (Trivy)
<details>
<summary>Click to view security scan</summary>

```

Report Summary

┌────────────────────────────┬────────────────────────┬───────────────────┐
│           Target           │          Type          │ Misconfigurations │
├────────────────────────────┼────────────────────────┼───────────────────┤
│ .                          │ terraformplan-snapshot │         0         │
├────────────────────────────┼────────────────────────┼───────────────────┤
│ modules/cloudfront/main.tf │ terraformplan-snapshot │         1         │
├────────────────────────────┼────────────────────────┼───────────────────┤
│ modules/ec2/main.tf        │ terraformplan-snapshot │         4         │
├────────────────────────────┼────────────────────────┼───────────────────┤
│ modules/s3/main.tf         │ terraformplan-snapshot │         2         │
├────────────────────────────┼────────────────────────┼───────────────────┤
│ modules/vpc/main.tf        │ terraformplan-snapshot │         0         │
└────────────────────────────┴────────────────────────┴───────────────────┘
Legend:
- '-': Not scanned
- '0': Clean (no security findings detected)


modules/cloudfront/main.tf (terraformplan-snapshot)
===================================================
Tests: 1 (SUCCESSES: 0, FAILURES: 1)
Failures: 1 (HIGH: 1, CRITICAL: 0)

AVD-AWS-0011 (HIGH): Distribution does not utilise a WAF.
════════════════════════════════════════
You should configure a Web Application Firewall in front of your CloudFront distribution. This will mitigate many types of attacks on your web application.


See https://avd.aquasec.com/misconfig/avd-aws-0011
────────────────────────────────────────
 modules/cloudfront/main.tf:10-69
   via main.tf:46-59 (module.cloudfront)
────────────────────────────────────────
  10 ┌ resource "aws_cloudfront_distribution" "cdn" {
  11 │   enabled = true
  12 │   aliases = [var.alias_name]
  13 │ 
  14 │   default_root_object = var.default_root_object
  15 │ 
  16 │   origin {
  17 │     domain_name = var.bucket_domain_name
  18 └     origin_id   = var.bucket_name
  ..   
────────────────────────────────────────



modules/ec2/main.tf (terraformplan-snapshot)
============================================
Tests: 4 (SUCCESSES: 0, FAILURES: 4)
Failures: 4 (HIGH: 3, CRITICAL: 1)

AVD-AWS-0028 (HIGH): Instance does not require IMDS access to require a token.
════════════════════════════════════════
IMDS v2 (Instance Metadata Service) introduced session authentication tokens which improve security when talking to IMDS.

By default <code>aws_instance</code> resource sets IMDS session auth tokens to be optional.

To fully protect IMDS you need to enable session tokens by using <code>metadata_options</code> block and its <code>http_tokens</code> variable set to <code>required</code>.


See https://avd.aquasec.com/misconfig/avd-aws-0028
────────────────────────────────────────
 modules/ec2/main.tf:41-101
   via main.tf:20-31 (module.ec2)
────────────────────────────────────────
  41 ┌ resource "aws_instance" "my_ec2" {
  42 │   ami                         = var.ami_id
  43 │   instance_type               = var.instance_type
  44 │   subnet_id                   = var.subnet_id
  45 │   key_name                    = var.key_name
  46 │   associate_public_ip_address = true
  47 │   vpc_security_group_ids      = [aws_security_group.sg.id]
  48 │   tags = {
  49 └     project = var.Name
  ..   
────────────────────────────────────────


AVD-AWS-0104 (CRITICAL): Security group rule allows unrestricted egress to any IP address.
════════════════════════════════════════
Opening up ports to connect out to the public internet is generally to be avoided. You should restrict access to IP addresses or ranges that are explicitly required where possible.


See https://avd.aquasec.com/misconfig/aws-vpc-no-public-egress-sgr
────────────────────────────────────────
 modules/ec2/main.tf:37
   via modules/ec2/main.tf:35-39 (aws_vpc_security_group_egress_rule.all_outbound)
    via main.tf:20-31 (module.ec2)
────────────────────────────────────────
  35   resource "aws_vpc_security_group_egress_rule" "all_outbound" {
  36     security_group_id = aws_security_group.sg.id
  37 [   cidr_ipv4         = "0.0.0.0/0"
  38     ip_protocol       = "-1" # all protocols
  39   }
────────────────────────────────────────


AVD-AWS-0107 (HIGH): Security group rule allows unrestricted ingress from any IP address.
════════════════════════════════════════
Security groups provide stateful filtering of ingress and egress network traffic to AWS
resources. It is recommended that no security group allows unrestricted ingress access to
remote server administration ports, such as SSH to port 22 and RDP to port 3389.


See https://avd.aquasec.com/misconfig/avd-aws-0107
────────────────────────────────────────
 modules/ec2/main.tf:13
   via modules/ec2/main.tf:11-17 (aws_vpc_security_group_ingress_rule.ssh)
    via main.tf:20-31 (module.ec2)
────────────────────────────────────────
  11   resource "aws_vpc_security_group_ingress_rule" "ssh" {
  12     security_group_id = aws_security_group.sg.id
  13 [   cidr_ipv4         = "0.0.0.0/0"
  14     from_port         = 22
  15     ip_protocol       = "tcp"
  16     to_port           = 22
  17   }
────────────────────────────────────────


AVD-AWS-0131 (HIGH): Root block device is not encrypted.
════════════════════════════════════════
Block devices should be encrypted to ensure sensitive data is held securely at rest.


See https://avd.aquasec.com/misconfig/avd-aws-0131
────────────────────────────────────────
 modules/ec2/main.tf:41-101
   via main.tf:20-31 (module.ec2)
────────────────────────────────────────
  41 ┌ resource "aws_instance" "my_ec2" {
  42 │   ami                         = var.ami_id
  43 │   instance_type               = var.instance_type
  44 │   subnet_id                   = var.subnet_id
  45 │   key_name                    = var.key_name
  46 │   associate_public_ip_address = true
  47 │   vpc_security_group_ids      = [aws_security_group.sg.id]
  48 │   tags = {
  49 └     project = var.Name
  ..   
────────────────────────────────────────



modules/s3/main.tf (terraformplan-snapshot)
===========================================
Tests: 2 (SUCCESSES: 0, FAILURES: 2)
Failures: 2 (HIGH: 2, CRITICAL: 0)

AVD-AWS-0088 (HIGH): Bucket does not have encryption enabled
════════════════════════════════════════
S3 Buckets should be encrypted to protect the data that is stored within them if access is compromised.


See https://avd.aquasec.com/misconfig/avd-aws-0088
────────────────────────────────────────
 modules/s3/main.tf:2-7
   via main.tf:35-41 (module.s3)
────────────────────────────────────────
   2 ┌ resource "aws_s3_bucket" "frontend_bucket" {
   3 │   bucket        = var.bucket_name
   4 │   force_destroy = true
   5 │ 
   6 │ 
   7 └ }
────────────────────────────────────────


AVD-AWS-0132 (HIGH): Bucket does not encrypt data with a customer managed key.
════════════════════════════════════════
Encryption using AWS keys provides protection for your S3 buckets. To increase control of the encryption and manage factors like rotation use customer managed keys.


See https://avd.aquasec.com/misconfig/avd-aws-0132
────────────────────────────────────────
 modules/s3/main.tf:2-7
   via main.tf:35-41 (module.s3)
────────────────────────────────────────
   2 ┌ resource "aws_s3_bucket" "frontend_bucket" {
   3 │   bucket        = var.bucket_name
   4 │   force_destroy = true
   5 │ 
   6 │ 
   7 └ }
────────────────────────────────────────



```

</details>

---

**Directory:** `Infrastructure/terraform`  
**Terraform Version:** `1.12.2`
